[
  {
    "path": "posts/2021-06-16-data-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "In this post, we present a trade data use case applying the appropriate interactive visual analytics techniques using Tableau. We will critique the visualisation and propose an alternative to improve the quality of message delivered.",
    "author": [
      {
        "name": "Alicia Zhang",
        "url": "https://www.linkedin.com/in/alicia-zhang-22a1a6140/"
      }
    ],
    "date": "2021-06-16",
    "categories": [],
    "contents": "\n\nContents\n1. Critique of Visualisation1.1 Clarity\n1.2 Aesthetic\n\n2. Alternative Design2.1 Clarity\n2.2 Aesthetic\n\n3. Proposed Visualization\n4. Step-by-step Guide\n5. Derived Insights\n\n1. Critique of Visualisation\nThe original visualisation is created by using the same data for makeover 1 and is provided by Department of Statistics, Singapore (DOS). The data are available under the sub-section of Merchandise Trade by Region/Market.\n\n1.1 Clarity\nTitles: This visualisation does not contain title and provide any information about the data like what this data set is about.\nLabel of trade values\nThough it states in the note that the size of the bubble reflects the total merchandise trade value with the trading partner, we don’t know the period of the aggregated trade volume and if it’s monthly, quarterly or yearly data. We can only infer it’s data in year 2020 when refering it to the original data.\nAs each bubble takes up some space, it does not correspond to the x-axis and y-axis clearly like points. Readers cannot tell the exact volume of import and export.\nThere’re some overlaps between bubbles. The bubbles of some trading partners like EU, United States and Republic of korea are blocked by neighbouring bubbles.Therefore, readers are not able to see the white circle and which area it falls into. There’s no way to tell whether those countries belong to net importers or net exporters.\n\nY-Axis and X-Axis There’s no indication of unit and currency in the x-axis and y-axis.\nInformation box The insights in the information box compare data since 2006 and show the change point of net trade volume of Mainland China with Singapore and Unites States with Singapore separately. However, it does not match with the static graph which only presents one year’s data.\n1.2 Aesthetic\nColors The graph used more than 10 colors. Colors are used to differentitate trading partners and do not encode values. Colors don’t reflect any differences between trading partners and should be minimized.\nData Ink Data ink are used in the graph. There’re some unnecssary data ink like light blue backgroud color outside the chart and should be removed to emphasize the rest data ink. Same for the information box. For such findings or insights, creator could emphasize it through putting on the subtitles or annotations in the graph.\nLengend The legend of Top Net Exporter and Top Net Importer is placed at the bottom of the graph. Readers could not immediately understand the meaning of the two icons without scrolling down to the bottom part.\nAnnotation Annotation with the trading partners and total trade values are too big and block bubbles representing the total trading values.\n2. Alternative Design\nMy proposed design is as follows. \n2.1 Clarity\nTitles: Add interactive title with parameter top trading partners and filter year. When reader select certain year and the number of top trading partners they want to look at, title will update automatically to match with the data retrievd.\nLabel of trade values\nAdding the year in the title and readers can see immediately from the title to know the periods of data.\nBy adding total trade value, net trade value, imports and exports in the tooltip, readers can read all information in details when they hover on the bubble.\nUsing transparency and border color and avoid one bubble obscures the other. Use two color diverging scheme, readers can tell if it’s a net exporter(blue) or net importer(red) from the color. They can also know the trade balance value from the darkness of the color. The darker the color, the larger the net trade balance.\n\nY-Axis and X-Axis Add singapore dollars in the x and y axis.\nInformation box By adding slopgraph and comparing the change between 2011 and 2020. We can see the change from the graph and numbers directly.\n2.2 Aesthetic\nColors Use only two colors to represent measures in each graph and each color represent different meaning. Red represents net importer and blue represents net exporter.\nData Ink Remove background colors and unnecssary color inks.\nLengend Shift the legend to the right top corner and make it more visible and easier to readers.\nAnnotation Adding annotation in the subtitles and use colors to highlight important messages.\n3. Proposed Visualization\nPlease view the interactive visualisation on Tableau Public here. \n4. Step-by-step Guide\nNo\nStep\nAction\n1\nUnzip the output folder downloaded from the SingStat website. Load the outputFile excel file into Tableau Prep Builder. Check ‘Cleaned with Data Interpreter’ and drag the ‘T1’ worksheet containing imports data into main pane.\n\n2\nRight click ‘+’ sign beside T1 table and add ‘Clean Step’.\n\n3\nSelect all columns except for Variables, 2011 Jan to 2020 Dec under Show list view.Click Rmove Fields.\n\n4\nClick ‘…’ in Variables column and click Custom Split. Use the separator ( to spilt off First and Last. Create two new variables.\n\n5\nChange two new variables names into Country and Unit. For Unit column, edit values and remove ). Remove the original column Variables.\n\n6\nCreat Pivot table by clicking ’+\" beside Clean 1 step. Drag all columns with dates into Pivot Fields.\n\n7\nClick ‘…’ in Pivot 1 Values column and click Custom Calculation. Convert imports values into the same unit dollar and name this calculated field as Imports.\n\n8\nRename Column Pivot1 Names as Date. Remove Pivot1 Values and Unit columns\n\n9\nRepeat the steps from 2 to 8 for working sheet T2. Drag Pivot 1 into Pivot 2 and join two tables.\n\n10\nAdd Join caluses “Country = Country” and “Date = Date”. Choose Inner join as the join type.\n\n11\nRemove dupliacted columns Date-1 and Country-1.\n\n12\nGenerate Output after cleaning the data set. Click Browse and locate the correct folder. Run flow and save this new file in hyper format.\n\n13\nOpen Tableau Desktop and load the saved hyper file. Click Filter on the right top corner and Add filter. Uncheck 5 Regions and Click OK. Click Date dropdown list and change data type from string to date.\n\n14\nClick sheet 1 and rename it as ‘Bubble Chart’. Drag Exports to columns and Imports to Rows.\n\n15\nClick Create Calculated Fields under Analysis tab. Create a new column called Net Trade Balance using the formula on the right side. Repeat the same step and create another column called Total by changing the formula to ‘[Exports] + [Imports]’.\n\n16\nDrag Net Trade Balance to Color. Adjust Opacity to 75% and change border color to grey. Drag Total to Size and move the cursor to the right. Drag Country to Detail.\n\n17\nClick Edit Colors in the color legend. Choose Red-Blue Diverging and set center to 0.\n\n18\nIn the Data pane, click the drop-down arrow in the upper right corner and select Create Parameter. Choose Top tab and name the parameter as Top Trading Partners. Set the range from 1 to 15 and step as 1.\n\n19\nIn the Data pane, right click Country and choose Create Set. Renmae this set asTop N Trading Partners by total trade volume. Choose Top and By field by Total SUM.\n\n20\nDrag Date from Data Panel to Filters shelf. Click “Year” and select all years.Drag Top N Trading Partners by Total Trade Value to Filters.\n\n21\nClick YEAR(Date) Filter dropdown list and choose Show Filter. Change filter to Singlae Value (list).\n\n22\nCreate two calculated fields Net Importer and Net Expoter.\n\n23\nDrag Total, Net Exporter and Net Importer into Label. Click format in Total and change Display unit to Billons (B) in Currency(Custom). Set Decimal places as 2. Change Fields to Net Exporter and Net Importer and change to the same number format.\n\n24\nClick any place in the main graph pane and choose format. Select None for the Grid Lines.\n\n25\nDouble clikc the title and edit the title to an interactive one by inserting paramter Top Trading Partners and filter YEAR(Date).\n\n26\nClick Tooltip and edit it as the picture shown on the right. Use different colors to represent various measures\n\n27\nDrag YEAR(Date) to the Pages shelf. On the top of the working sheet, click Format and select Animations. Turn on the Animations effect and change the duration to Medium.\n\n28\nCreat a new working sheet and name it as Slopegraph. Creat a new parameter called ‘Select’ and add a list of values from Imports to Net trade value.\n\n29\nClick ‘Select’ and create calculated value “Selected” using the formuala on the right.\n\n30\nCreate four calculated fields Delta, Delta percent, Magnitude and Direction.\n\n31\nDrag YEAR(Date) into Columns and Selected into Rows.\n\n32\nDrag Direction into Color shelf and change Decreased to red and Increased to blue.\n\n33\nDrag Magnitude into Size, Country and Delta percent into Label and Country into Detail. Right click Label and edit it to Country, Delta percent %.\n\n34\nDrag Top N Trading Partners by total trade value and YEAR(Date) into Filters shelf. Select year 2011 and year 2020. Add graph title.\n\n35\nCreat Dashboard 1 and drag two sheets Bubble Chart and Slopgraph into the blank pane.\n\n36\nDelete Year filter and Magnitude legend beside the slopegraph.\n\n37\nClick Actions.. under Dashboard tab. Add action Highlight. Choose Hover and Target Highlighting Selected Fields Country to link two sheets.\n\n38\nAdd main title and findings.\n\n5. Derived Insights\nMainland China China has increased 33.9% from 2011 to 2020 in terms of total trade value with 35.9% increase in imports and 32% increase in exports. If playing the animations, it can be found that it has always been net exporter in blue color for 10 years. Net trade balance dropped to the lowest point S$1 Billion which is grey in year 2018. It exceeded Malaysia and became the top 1 trading partner in 2013.Though the total trade value increased positively, the growth rate ranks only number 3 and it’s lower than United States(35%) and Taiwan(64.6%). \n2.Hongkong has been top 1 net exporter since 2011 and exports value kept in the range between 55 billions and 65 billions Singapore dollars which is relatively stable. It has replaced Indonesia and became the second largest trading partner Singapore exporting to.\nTaiwan Taiwan’s trade with Singapore has grown exponentially in the past 10 year and has been the top 1 net importer in 2020. The total trade value increased 64.6% and imports increased 83.1% which is the highest among all trading partners.\nIndonesia and Malaysia Indonesia and Malaysia used to be among top 3 net exporters with Singapore. However, both exports values droppped significantly with 48.1% and 28.4% respectively. Malaysia has change from net exporter to net importer since 2019. \nUnited States United States has also experienced fast growth in trade with Singapore with 35% increase in total trade value. It catched up with European Union and exceeded EU in 2019. What’s interesting is the net trade balance in 2020 which exports exceeded imports. Before 2020, United States has always been a net exporter.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-06-19T17:12:53+08:00",
    "input_file": "data-makeover-2.knit.md"
  },
  {
    "path": "posts/2021-05-28-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "Alicia Zhang",
        "url": "https://www.linkedin.com/in/alicia-zhang-22a1a6140/"
      }
    ],
    "date": "2021-05-28",
    "categories": [],
    "contents": "\n\nContents\n1 Critique of Visualisation1.1 Clarity\n1.2 Aesthetic\n\n2 Alternative Design2.1 Clarity\n2.2 Aesthetic\n\n3 Proposed Visualization\n4 Step-by-step Guide4.1 Data Cleaning using Tableau Prep Builder\n4.2 Data Visualization using Tableau Desktop\n\n5 Derived Insights\n\n1 Critique of Visualisation\nThe original visualisation can be seen below. \n1.1 Clarity\n\nThe main title does not match with the data in the graph. Main title shows data from 2019 to 2020, but the graph plots data from 2019 till 2021.It will create confusion among readers. Main title also does not indicate that the merchandise trade was between Singapore and its top 6 trading countries between 2019 to 2020.\n\n\nThe graph does not have any subtitle to describe the information or provide any insight derived from it.\nx-axis label does not match with its values. x-axis label is Month of Period, but x-axis values are years, i.e. 20219,2020 and 2021.\nScales in y axis for Export and Import are different. For example, in the first pane of Hong Kong, monthly Export values range from 0-6M while monthly Import values are only between 0-800K. Such plot may mislead readers and give them the wrong perception of the actual merchandise trade volumes.\n\n1.2 Aesthetic\nThe main title at the top is not in line with the main graph and country/region names in each pane is not in line with individual graph.\nThere’s overlap between Export and Import. The mixture of colors makes the the graph a bit blur and not easy to differentiate between the two variables.\nx-axis labels Month of Period is not necessary as it’s time series and should be self explanatory.\nAnnotations are not used to convey points, leaving the reader to interprete the purpose of the graph. Lack of information source, indication of currency and unit.\n2 Alternative Design\nThe proposed design is as follows. \n2.1 Clarity\nTitle and subtitle are added to explain the purpose and major findings of the visualization. Only data in 2019 and 2020 is selected and avoid conflicts between title and graph. Instead of looking at monthly merchandise trade, the new visualization will look at data in quarterly level. The aggregated data can give readers clearer perspectives on the seasonal changes between two years and provide them meaningful insights.\nExport and import are separated into two sections vertically. Scales of the two are set to be the same. Therefore, comparison between export and import can be conducted directly and clearly. Meanwhile, each country/region’s data is divided into two parts based on the year. So it’s easier to compare quartely trend changes between two years.\nx-axis values are changed to four quarters which corresponding to the title.\n2.2 Aesthetic\nChart Title and country/region names are aligned with the main graph and individual graphs.Six country/region are sorted in descending order based on the sum of export and import values.\nExport and import are separated into two sections and coulor is used to differentiate different categories, i.e. country/region.\nx-axis labels are removed.\nAnnotations are added to provide detailed analysis on individual country/region and missing information like source and currency.\n3 Proposed Visualization\nPlease view the interactive visualisation on Tableau Public here.\n4 Step-by-step Guide\n4.1 Data Cleaning using Tableau Prep Builder\n4.1.1 Download data from DOS website\nEnter DOS website with the link and click Download all in Excel under Merchandise Trade by Region/Market\n\n4.1.2 Loading data into Tableau Prep Builder\nOpen Tableau Prep Builder and use it to do the data preparation.\nOpen Finder and locate the data file. Drag the file into the the working pane.\n\n4.1.3 Clean data\nCheck Cleaned with Data Interpretation\nDrag T1 working sheet into the Flow Pane\nClick + and choose Clean Step\n\n4.1.4 Select target periods and countries\nChange to Show List View. Select 24 fields from 2019 Jan to 2020 Dec and field Variables.\nClick on Keep Only Fields.\n\nChoose Show Profile Pane. Select targeted 6 countries/regions.\nClick on Keep Only.\n\n4.1.5 Splits field variables and create new fields\nClick on … dropdown list and select Custom Split.\nUse separator (, split off first and 1. Rename field to Country.\nRepeat the above steps, change first to last. Edit value to Thousand Dollars and rename field to currency.\n\n\n4.1.6 Pivot data\nClick + on Clean 1 step and choose Pivot.\nChange to Show List View.Select 24 months Fields and drag to Pivot Values.\n\n4.1.7 Convert pivot values from thousand dollars to dollars\nClick … on the Pivot1 Values. Choose Custom Calculation.\nFill in formulas.\n\n4.1.8 Change Field Currency to Type\nClick Group Values under Currency Manual Selection. Change field value Thousand dollars to Import.\nChange Field Name from Currency to Type.\n\n4.1.9 Clean second working sheet T2 and combine 2 tables\nRepeat the above steps and clean T2.\nDrag T1 to T2 and choose Union. Create a new table called Union 1.\nRemove new field Table Names.\n\n4.1.10 Create output\nClick + on the Union 1 step and choose Output.\n4.1.11 Run flow and save file\nChange the file name to Singapore trade_2019-2020_clean.\nClick Run Flow and save the file.\n\n4.2 Data Visualization using Tableau Desktop\n4.2.1 Load cleaned data file into Tableau Desktop\nOpen Tableau Desktop and drag the cleaned data file into the working pane\n\n4.2.2 Draw skeleton plot\nDrag Country into Columns.\nDrag Date into Columns and date become years. Click Years and choose Quarter.\nDrag Type into Rows.\nDrag Values into Rows.\n\n4.2.3 View Data\nClick View Data under Analysis and check the new data set.\n\n\n4.2.4 Choose color to differentiate countries\nDrag Country into Color.\n\n4.2.5 Change line thickness\nClick Size, drag the circle to the left and make the line thinner.\n\n4.2.6 Sort Countries in descending order\nClick dropdown list in the legend Country and choose Sort.\nSelect Sort By Field and Sort Order Descending.\nChoose Field Name Values and use default Aggregation Sum.\n\n\n4.2.7 Add reference line into the graph\nClick Values y axis and choose Add Reference Line.\n\nSet the reference line as below and add average line for each quarter.\n\nClick Values y axis and uncheck Show Header to remove y axis label Values.\n4.2.8 Hide field labels for columns and rows\nClick column field label and select Hide Field Labels for Columns.\nClick row field label and select Hide Field Labels for Rows.\n\n4.2.9 Change the main titles and add subtitles\nClick title, change the main title and add subtitle.\n\n4.2.10 Add annotations\nClick one of the pane and choose Area under Annotate.\nAdd findings using annotation area.\n\n4.2.11 Add Captions\nClick x axis and choose Caption. Add data source, currency and notes.\n\n\n5 Derived Insights\nMy proposed design is as below: \n1. Singapore Merchandise export with 6 major trading parterners\nCompared to 2019, Singapore’s yearly merchandise export to 6 countries/regions generally remain the same or slightly increased except for to Malaysia. It’s consistent with the overall export growth rate 4.3% despite the Covid pandemic in 2020 and one of the drivers is the persistent global demand for semiconductors and pharmaceuticals (KENTARO IWAMOTO, 2021). For the largest export destionation China, export value declined in the first two quarters while it increased rapidly from Q3 onwards. It’s projected to keep the increase trend in 2021 given its good control of covid 19 and progressive vaccination program. It needs to get Singapore’s government and cooperates more attention. Singapore also experienced increased demand from United States in 2020. However, the demand decreased slightly in Q4 2020 compared to previous quarter though it’s still higher than the same period in 2019. It maybe related to the worsening covid situation in America and more research can be conducted to investigate the change.\nSingapore exports grow in 2020 despite COVID turmoil\nSingapore’s Top Trading Partners\n2. Singapore Merchandise import with 6 major trading parterners\nCompared with export, Singapore’s yearly import remains relatively stable in 2020. Though there’s some fluctuations over the quarters in some countries. It’s quite alarming that import from United States dropped significantly and the decreasing trend could probably continue in 2021. Besides that, import from neighbouring country Malaysia declined a lot in Q2. The main reason could be Malaysian Movement Control Order (MCO) 1.0 implemented from 18 March to 3 May 2020. It led to a hit to Malaysian’s economy. Singaporean government should monitor Malaysia’s export regulations&policies closely as Singapore relies heavily to it.It’s vital to keep a secure supply chain of food and other resources. Government needs to review its current import strategies and diversitify its import sources.\nWiki:Malaysian movement control order\n3. Trade with Taiwan\nTaiwan is the only region experienced growth in both export and import among 6 listed countries/regions.Taiwan has became one of the most important sources of import and the yearly import value has reached more than 40B singapore dollars. Singapore and Taiwan signed a free trade agreement including removing custom duties to deepen bilateral trade in 2013. Both parties shall work more closely to find out potential trading opportunties.\nEconomic Partnership Agreement Between Singapore and Taiwan\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-30T19:43:17+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to DataViz Blog",
    "description": "Welcome to my new blog, DataViz Blog. I hope you enjoy \nreading what I have to say!",
    "author": [
      {
        "name": "Alicia Zhang",
        "url": "https://www.linkedin.com/in/alicia-zhang-22a1a6140/"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-24T16:32:18+08:00",
    "input_file": {}
  }
]
